{
    "Flow":{
        "Parts":{
            "VideoFile":{
                "Description":"An input video file that has had its VideoInformation read and can be processed"
            },
            "DetectBlackBars":{
                "Description":"Processes a video file and scans for black bars in the video.\n\nIf found a parameter \"VideoCrop\" will be added.\n\nOutput 1: Black bars detected\nOutput 2: Not detected"
            },
            "VideoCodec":{
                "Description":"This node will check the codecs in the input file, and trigger when matched.\n\nOutput 1: Matches\nOutput 2: Does not match",
                "Fields":{
                    "Codecs":"Codecs",
                    "Codecs-Help":"Enter a list of case insensitive video or audio codecs.\nEg hevc, h265, mpeg4, ac3"
                }
            },
            "VideoEncode":{
                "Description":"A generic video encoding node, this lets you customize how to encode a video file using ffmpeg.\n\nOutput 1: Video was processed\nOutput 2: No processing required",
                "Fields":{  
                    "VideoCodec":"Video Codec",
                    "VideoCodec-Help":"The video codec the video should be in, for example hevc, h264",
                    "VideoCodecParameters":"Video Codec Parameters",
                    "VideoCodecParameters-Help":"The parameters to use to encode the video, eg. \"hevc_nvenc -preset hq -crf 23\" to encode into hevc using the HQ preset a constant rate factor of 23 and using NVIDIA hardware acceleration.",
                    "AudioCodec":"Audio Codec",
                    "AudioCodec-Help":"The audio codec to encode the video with",                    
                    "Language":"Language",
                    "Language-Help":"Optional ISO 639-2 language code to use.  Will attempt to find an audio track with this language code if not the best audio track will be used.\nhttps://en.wikipedia.org/wiki/List_of_ISO_639-2_codes"                   
                }
            },
            "Video_H265_AC3":{
                "Description":"This will ensure all videos are encoded in H265 (if not already encoded) and that AC3 audio is the first audio channel\n\nOutput 1: Video was processed\nOutput 2: No processing required",
                "Fields":{
                    "Language":"Language",
                    "Language-Help":"Optional ISO 639-2 language code to use.  Will attempt to find an audio track with this language code if not the best audio track will be used.\nhttps://en.wikipedia.org/wiki/List_of_ISO_639-2_codes",
                    "Crf":"Constant Rate Factor",
                    "Crf-Help":"Refer to ffmpeg for more details, the lower the value the bigger the file.  A good value is around 19-23.  Default is 21.",
                    "NvidiaEncoding":"NVIDIA Encoding",
                    "NvidiaEncoding-Help":"If NVIDIA hardware encoding should be used.  If you do not have a supported NVIDIA card the encoding will fail.",
                    "Threads":"Threads",
                    "Threads-Help":"Only used if not using NVIDIA.  If set to 0, the threads will use FFMpegs defaults."
                }
            },
            "FFMPEG":{
                "Description":"The node lets you run any FFMPEG command you like.  Giving you full control over what it can do.\n\nFor more information refer to the FFMPEG documentation",
                "Fields":{                    
                    "CommandLine":"Command Line",
                    "CommandLine-Help":"The command line to run with FFMPEG.\n'{WorkingFile}': the working file of the flow\n'{TempDir}': The temp directory, including trailing directory separator, where files are generally created during the flow."
                }
            }
        }
    }
}